using Tyuiu.BushuevaSR.Sprint2.Task5.V7.Lib;
namespace Tyuiu.BushuevaSR.Sprint2.Task5.V7
{
    internal class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #2 | Выполнил: Бушуева С.Р. | ПИНб-26-1 ";

            Console.WriteLine("*****************************************************************************************************************");
            Console.WriteLine("* Спринт #2                                                                                                     *");
            Console.WriteLine("* Тема: Базовые навыки работы в C#                                                                              *");
            Console.WriteLine("* Задание #5                                                                                                    *");
            Console.WriteLine("* Вариант #1                                                                                                    *");
            Console.WriteLine("* Выполнила: Бушуева Софья Романовна | ПИНб-26-1                                                                *");
            Console.WriteLine("*****************************************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                                      *");
            Console.WriteLine("* Написать программу, которая использует оператор switch вычисляет требуемое значение и возвращает результат.   *");
            Console.WriteLine("* Условие: С начала 1990 года по некоторый день прошло n месяцев и 2 дня.                                       *");
            Console.WriteLine("* Определить название месяца (январь, февраль и т. п.) этого дня.                                               *");
            Console.WriteLine("*****************************************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                              *");
            Console.WriteLine("*****************************************************************************************************************");

            Console.WriteLine("Введите номер месяца: ");
            int n = Convert.ToInt32(Console.ReadLine());

            string res;

            if ((n < 1) || (n > 12))
            {
                res = "Введено неверное значение";
            }
            else
            {
                res = "Это месяц: " + ds.FindMonthName(1990, n + 1);
            }
            Console.WriteLine("*****************************************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                    *");
            Console.WriteLine("*****************************************************************************************************************");
           
            Console.WriteLine(res);

            Console.ReadKey();
        }
    }
}
